#Область ПрограммныйИнтерфейс

// Прочитаь конфигурационный файл и вернуть его содержимое в виде соответствия данных.
//
//  Возвращаемое значение:
//   Соответствие - Данные конфигурации, если файл существует и успешно прочитан, иначе Неопределено.
//
Функция Прочитать() Экспорт
	
	Если НЕ ФайлСуществует() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьФайл(ПутьКФайлу());
	
	Попытка
		Конфигурация = ПрочитатьJSON(Чтение, Истина);
	Исключение
		Чтение.Закрыть();
		ВызватьИсключение;
	КонецПопытки;
	
	Чтение.Закрыть();
	
	Возврат Конфигурация;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяФайла()
	
	Возврат "config.json";
	
КонецФункции

Функция ПутьКФайлу()
	
	КаталогСценария = ТекущийСценарий().Каталог;
	ИсходныйКаталог = ОбъединитьПути(КаталогСценария, "..", "..");
	
	Возврат ОбъединитьПути(ИсходныйКаталог, "config", ИмяФайла());
	
КонецФункции

Функция ФайлСуществует()
	
	Файл = Новый Файл(ПутьКФайлу());
	
	Возврат Файл.Существует();
	
КонецФункции

#КонецОбласти