
#Область ПрограммныйИнтерфейс

// Прочитать переменные окружения из файла .env и установить их в текущей среде выполнения 1С:Предприятия.
//
Процедура Прочитать() Экспорт

	Если Не ФайлСуществует() Тогда
		Возврат;
	КонецЕсли;

	ПеременныеОкружения = ПрочитатьПеременныеОкруженияИзФайла();

	Для Каждого КлючЗначение Из ПеременныеОкружения Цикл
		УстановитьПеременнуюСреды(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяФайла()
	
	Возврат ".env";

КонецФункции

Функция ПутьКФайлу()
	
	КаталогСценария = ТекущийСценарий().Каталог;
	ИсходныйКаталог = ОбъединитьПути(КаталогСценария, "..", "..");
	ПутьКФайлу = ОбъединитьПути(ИсходныйКаталог, "config", ИмяФайла());

	Возврат ПутьКФайлу;

КонецФункции

Функция ФайлСуществует()
	
	ПутьКФайлу = ПутьКФайлу();
	Файл = Новый Файл(ПутьКФайлу);
    ФайлСуществует = Файл.Существует();

	Возврат ФайлСуществует;

КонецФункции

Функция ПрочитатьПеременныеОкруженияИзФайла()
	
	ПеременныеОкружения = Новый Соответствие();

	Чтение = Новый ЧтениеТекста(ПутьКФайлу(), КодировкаТекста.UTF8);

	Пока Истина Цикл
		
		ТекущаяСтрокаФайла = Чтение.ПрочитатьСтроку();
		Если ТекущаяСтрокаФайла = Неопределено Тогда
			Прервать;
		КонецЕсли;

		ТекущаяСтрокаФайла = СокрЛП(ТекущаяСтрокаФайла);
        Если ПустаяСтрока(ТекущаяСтрокаФайла) 
			Или Лев(ТекущаяСтрокаФайла, 1) = "#" Тогда
            Продолжить;
        КонецЕсли;

        ПозицияРавно = Найти(ТекущаяСтрокаФайла, "=");
        Если ПозицияРавно = 0 Тогда
            Продолжить;
        КонецЕсли;

        ИмяПеременной = СокрЛП(Лев(ТекущаяСтрокаФайла, ПозицияРавно - 1));
        ЗначениеПеременной = СокрЛП(Сред(ТекущаяСтрокаФайла, ПозицияРавно + 1));

		Если ПустаяСтрока(ИмяПеременной) Тогда
			Продолжить;
		КонецЕсли;

		ЗначениеПеременной = УдалитьОбрамляющиеКавычки(ЗначениеПеременной);

		ПеременныеОкружения.Вставить(ИмяПеременной, ЗначениеПеременной);

	КонецЦикла;

	Возврат ПеременныеОкружения;

КонецФункции

Функция УдалитьОбрамляющиеКавычки(Значение)

	Если СтрДлина(Значение) < 2 Тогда
		Возврат Значение;
	КонецЕсли;

	ПервыйСимвол = Лев(Значение, 1);
	ПоследнийСимвол = Прав(Значение, 1);
	ОбрамленоДвойнымиКавычками = ПервыйСимвол = """"
		И ПоследнийСимвол = """";
	ОбрамленоОдинарнымиКавычками = ПервыйСимвол = "'"
		И ПоследнийСимвол = "'";

	Если Не ОбрамленоДвойнымиКавычками
		И Не ОбрамленоОдинарнымиКавычками Тогда
		Возврат Значение;
	КонецЕсли;

	Возврат Сред(Значение, 2, СтрДлина(Значение) - 2);

КонецФункции

#КонецОбласти
