#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьТестовоеИзИсходников(ПутьКБазе, ПутьКИсходникам, ВерсияПлатформы, Разрядность, Авторизация, ПоказыватьОкна = Истина) Экспорт

	Процессы = Новый ЗапускПроцессов();
	ОперацииБазы = Новый ОперацииСБазой1С();
	Команда = "vrunner compileext"
		+ " " + Процессы.Аргумент(ПутьКИсходникам)
		+ " ТестированиеТБ"
		+ " --nocacheuse"
		+ " --bitness=" + Разрядность
		+ " --ibconnection " + Процессы.Аргумент("/F" + ПутьКБазе)
		+ " --v8version " + Процессы.Аргумент(ВерсияПлатформы);
	Команда = ОперацииБазы.ДобавитьАвторизациюVanessa(Команда, Процессы, Авторизация);
	Процессы.ВыполнитьКоманду(Команда, "Загрузка тестового расширения ТестированиеТБ", ПоказыватьОкна);

КонецПроцедуры

Процедура ЗагрузитьИзCFE(ПутьКБазе, ПутьКCFE, ИмяРасширения, ВерсияПлатформы, Разрядность, Авторизация, ПоказыватьОкна = Истина) Экспорт

	Процессы = Новый ЗапускПроцессов();
	ОперацииБазы = Новый ОперацииСБазой1С();
	Команда = "vrunner loadext"
		+ " --nocacheuse"
		+ " --bitness=" + Разрядность
		+ " --updatedb"
		+ " --ibconnection " + Процессы.Аргумент("/F" + ПутьКБазе)
		+ " --v8version " + Процессы.Аргумент(ВерсияПлатформы)
		+ " --file " + Процессы.Аргумент(ПутьКCFE)
		+ " --extension " + Процессы.Аргумент(ИмяРасширения);
	Команда = ОперацииБазы.ДобавитьАвторизациюVanessa(Команда, Процессы, Авторизация);
	Процессы.ВыполнитьКоманду(Команда, "Загрузка расширения " + ИмяРасширения, ПоказыватьОкна);

КонецПроцедуры

Процедура ОтключитьОграничения(ПутьКБазе, ИмяРасширения, ВерсияПлатформы, Разрядность, Авторизация, ЭтоТестовоеРасширение, ПоказыватьОкна = Истина) Экспорт

	Процессы = Новый ЗапускПроцессов();
	ОперацииБазы = Новый ОперацииСБазой1С();
	ПутьКIBCmd = ОперацииБазы.ПолучитьПутьКIBCmd(ВерсияПлатформы, Разрядность);
	Команда = Процессы.Аргумент(ПутьКIBCmd)
		+ " infobase config extension update"
		+ " --db-path=" + Процессы.Аргумент(ПутьКБазе)
		+ " --name=" + Процессы.Аргумент(ИмяРасширения)
		+ " --safe-mode=no"
		+ " --unsafe-action-protection=no";
	Если ЭтоТестовоеРасширение Тогда
		Команда = Команда + " --used-in-distributed-infobase=no";
	КонецЕсли;
	Команда = ОперацииБазы.ДобавитьАвторизациюIBCmd(Команда, Процессы, Авторизация);
	Процессы.ВыполнитьКоманду(Команда, "Отключение ограничений расширения " + ИмяРасширения, ПоказыватьОкна);

КонецПроцедуры

#КонецОбласти
