КаталогСценария = ТекущийСценарий().Каталог;
КореньПроекта = ОбъединитьПути(КаталогСценария, "..");

ПодключитьСценарий(
	ОбъединитьПути(КореньПроекта, "src", "lib", "env.os"),
	"ПараметрыОкружения"
);

Окружение = Новый ПараметрыОкружения();
Окружение.Прочитать();

ПодключитьСценарий(
	ОбъединитьПути(КореньПроекта, "src", "workflows", "download_cfe_bsp.os"),
	"ЗагрузкаCFEBSP"
);

Workflow = Новый ЗагрузкаCFEBSP();
Workflow.Запустить(
	ПолучитьПеременнуюСреды("BSP_CFE_ARCHIVE_URL"),
	ОбъединитьПути(КореньПроекта, ".temp"),
	"bsp.cfe"
);

Сообщить("Файл CFE успешно скачан и сохранён.");
