КаталогСценария = ТекущийСценарий().Каталог;
КореньПроекта = ОбъединитьПути(КаталогСценария, "..");

ПодключитьСценарий(ОбъединитьПути(КореньПроекта, "src", "lib", "env.os"), "ПараметрыОкружения");
Окружение = Новый ПараметрыОкружения();
Окружение.Прочитать();

ПодключитьСценарий(ОбъединитьПути(КореньПроекта, "src", "lib", "arguments.os"), "АргументыСкриптов");
ПодключитьСценарий(ОбъединитьПути(КореньПроекта, "src", "workflows", "create_or_update_database.os"), "СозданиеИОбновлениеБазыДанных");

ОжидаемыеИмена = Новый Массив;
ОжидаемыеИмена.Добавить("--db-path");
ОжидаемыеИмена.Добавить("--worktree-name");
ОжидаемыеИмена.Добавить("--worktree-path");

ПарсерАргументов = Новый АргументыСкриптов();
Параметры = ПарсерАргументов.ПрочитатьИменованныеПараметры(
	АргументыКоманднойСтроки,
	ОжидаемыеИмена
);

ПараметрыСреды = Новый Структура;
ПараметрыСреды.Вставить("ONE_C_BASES_PATH", ПолучитьПеременнуюСреды("ONE_C_BASES_PATH"));
ПараметрыСреды.Вставить("ONE_C_PLATFORM_VERSION", ПолучитьПеременнуюСреды("ONE_C_PLATFORM_VERSION"));
ПараметрыСреды.Вставить("ONE_C_PLATFORM_BITNESS", ПолучитьПеременнуюСреды("ONE_C_PLATFORM_BITNESS"));
ПараметрыСреды.Вставить("ONE_C_INFOBASE_USER", ПолучитьПеременнуюСреды("ONE_C_INFOBASE_USER"));
ПараметрыСреды.Вставить("ONE_C_INFOBASE_PASSWORD", ПолучитьПеременнуюСреды("ONE_C_INFOBASE_PASSWORD"));
ПараметрыСреды.Вставить("WORKTREE_PATH_CFE_TEST", ПолучитьПеременнуюСреды("WORKTREE_PATH_CFE_TEST"));

Workflow = Новый СозданиеИОбновлениеБазыДанных();
Workflow.ЗагрузитьТестовоеРасширениеВСуществующуюБазу(
	Параметры.Получить("worktree-name"),
	Параметры.Получить("worktree-path"),
	Параметры.Получить("db-path"),
	ПараметрыСреды,
	КореньПроекта
);
